uhnp/src/InformationRegisters/НастройкиИспользованияШаблоновМероприятий/НастройкиИспользованияШаблоновМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИспользованияШаблоновМероприятий</name>
  <resources>
    <name>НазначенОсновным</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РасписаниеПовторения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>EnumRef.СпособыВыбораПоставщика</types>
      <types>CatalogRef.Цели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ОценкаПоставщиков</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/НастройкиИспользованияШаблоновМероприятий/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Снимает флаг основного шаблона для всех записей регистра,
// где измерения совпадают с измерениями записи ЗаписьВход, кроме
// самой записи.
Процедура СнятьПризнакОсновногоСПрочихШаблонов(ЗаписьВход)
	НачатьТранзакцию();
	ЕстьОшибки = Ложь;
	Попытка
		// Выборка данных для редактирования.
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиИспользованияШаблоновМероприятий.Контекст КАК Контекст,
		|	НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия КАК ШаблонМероприятия,
		|	НастройкиИспользованияШаблоновМероприятий.ВидМероприятия КАК ВидМероприятия,
		|	НастройкиИспользованияШаблоновМероприятий.НазначенОсновным КАК НазначенОсновным
		|ИЗ
		|	РегистрСведений.НастройкиИспользованияШаблоновМероприятий КАК НастройкиИспользованияШаблоновМероприятий
		|ГДЕ
		|	НастройкиИспользованияШаблоновМероприятий.Контекст = &Контекст
		|	И НастройкиИспользованияШаблоновМероприятий.ШаблонМероприятия <> &ШаблонМероприятия
		|	И НастройкиИспользованияШаблоновМероприятий.ВидМероприятия = &ВидМероприятия
		|	И НастройкиИспользованияШаблоновМероприятий.НазначенОсновным";
		Запрос.УстановитьПараметр("ВидМероприятия", ЗаписьВход.ВидМероприятия);
		Запрос.УстановитьПараметр("Контекст", ЗаписьВход.Контекст);
		Запрос.УстановитьПараметр("ШаблонМероприятия", ЗаписьВход.ШаблонМероприятия);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Обновление флага основного шаблона для выбранных записей.
			НаборЗаписей = РегистрыСведений.НастройкиИспользованияШаблоновМероприятий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Контекст.Установить(ВыборкаДетальныеЗаписи.Контекст);
			НаборЗаписей.Отбор.ШаблонМероприятия.Установить(ВыборкаДетальныеЗаписи.ШаблонМероприятия);
			НаборЗаписей.Отбор.ВидМероприятия.Установить(ВыборкаДетальныеЗаписи.ВидМероприятия);
			НаборЗаписей.Прочитать();
			Для Каждого ТекНаборЗаписей Из НаборЗаписей Цикл
				ТекНаборЗаписей.НазначенОсновным = Ложь;
			КонецЦикла;	
			НаборЗаписей.Записать();
		КонецЦикла;
	Исключение
		ТекстСообщения = НСтр("ru = 'При записи настроек возникли ошибки: %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЕстьОшибки = Истина;
	КонецПопытки;
	// Фиксирование транзакции.
	Если НЕ ЕстьОшибки Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;	
КонецПроцедуры		// СнятьПризнакОсновногоСПрочихШаблонов()	

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	// Добавление заданий на создание мероприятий из расписаний.
	ДатаРабочая = ТекущаяДатаСеанса();
	ПустаяДата = Дата(1, 1, 1);
	Для Каждого ТекВыгрузка Из ЭтотОбъект.Выгрузить() Цикл
		ТекВидМероприятия = ТекВыгрузка.ВидМероприятия; 
		ЭтоКонтрольноеМероприятие = (ТекВидМероприятия = Перечисления.ВидыМероприятий.КонтрольноеМероприятие);
		РасписаниеИспользуется = ТекВыгрузка.ИспользоватьРасписание;
		Если (ЭтоКонтрольноеМероприятие) И (РасписаниеИспользуется) Тогда
			РасписаниеОбъект = ТекВыгрузка.РасписаниеПовторения.Получить();
			Если ТипЗнч(РасписаниеОбъект) = Тип("РасписаниеРегламентногоЗадания") Тогда
				НоваяДата = УправлениеРисками.ПолучитьЗапланированныйМоментЗапускаЗадания(РасписаниеОбъект, "", ДатаРабочая + 1, ДатаРабочая);
				УправлениеРисками.УстановитьДатуСозданияМероприятияПоРасписанию(ТекВыгрузка.ШаблонМероприятия, ТекВыгрузка.Контекст, ПустаяДата, НоваяДата);
			Иначе
				// Неизвестный вариант. Выполняем далее.
			КонецЕсли;	
		Иначе
			// Для данной строки не требуется создание мероприятий по расписанию. Пропускаем.
		КонецЕсли;
	КонецЦикла;	
	// Снятие признака Основной у прочих шаблонов.
	Для Каждого ТекВыгрузка Из ЭтотОбъект.Выгрузить() Цикл
		Если ТекВыгрузка.НазначенОсновным Тогда
			СнятьПризнакОсновногоСПрочихШаблонов(ТекВыгрузка);
		Иначе
			// Выполняем далее.
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

#КонецЕсли
